import { ObjectMultiItemsTypes, ObjectTypes } from "../../../objects-to-jsx";
import { StringTypeEnum } from "../../../objects-to-jsx/string-to-jsx";

export const aboutPageData: ObjectMultiItemsTypes = [
    {
        type: ObjectTypes.title,
        text: ["რატომ შეიქმნა KIX და ვინ შექმნა ის?"],
    }, {
        type: ObjectTypes.description,
        text: [`KIX შემქმნელი და ავტორია `,
            {
                type: StringTypeEnum.url,
                url: "https://www.linkedin.com/in/soso-tsertsvadze-795565204/",
                text: ["სოსო ცერცვაძე"]
            },
            ` ის შეიქმნა პირადი გამოყენებისთვის, მისი შექმნის იდეა წლების მანძილზე ყალიბდებოდა ავტორის პირად გამოცდილებაზე დაყრდნობით, აპლიკაციას ჰყავდა რამოდენიმე წინამორბედი სანამ ამ სასხემდე მივიდოდა ქის შემქნის პროცესისას მთავარი იდეა იყო მიგვეღო მაქსიმალურად მაღალაი წარმადობა და მაქსიმალურად დინამიური კოდი მაქსიმალურად მინიმალური რესურსებით მისი შექმნა დაიწყო 2020 წელს და დღემდე მიმდინარეობს მისი გაუმჯობესებაზე მუშაობა`
        ],
    }, [], [], {
        type: ObjectTypes.title,
        text: ["რა იქნება მომავალში?"],
        size: 3
    }, {
        type: ObjectTypes.description,
        text: [`მომავალში ავტორი გპირდებათ მულტი პლათფორმულ მხარდაჭერას, თქვენ გექნებათ შესაძლებლობა KIX გამოიყენოთ ნებისმიერ GUI აპლიკაციის შესამქნელად (ამჟამად KIX ის გამოყენება რეკომენდირებული მხოლოდ WEB აპლიკაიების შესაქმნელად)`],
    }, [], [], {
        type: ObjectTypes.title,
        text: ["რა სჭირდება KIX სწრაფი განვითარებისთვის? "],
        size: 3
    }, {
        type: ObjectTypes.description,
        text: [`თუ თქვენთვის საინტერესო აპლიკაციასთან გაქვთ საქმე მადლობელი ვიქნებით თუ გააცნობთ მას უფრო ფართო აუდიტორიას ეს ჩვენთვის მნიშვნელოვანია ❤️`],
    },
]