{
    "Text_1": "KIX არის ჯავასკრიფტის ყველაზე სწრაფი და მარტივი საშუალება შექმნათ ვებ ინტეფეისი, მისი იდეა დაფუძნებულია სიმარტივესა და მინიმალიზმზე, ის გამოირჩევა მისი დინამიურობით და სწრაფი ჩატვირთვის უნარით ჩვენ გთავაზობთ მაქსიმალიზმს მინიმალური ხელსაწყოებით",
    "Text_2": "KIX საშუალებას გაძლევთ შექმნათ როგორც ცენტრალიზებული ისე დეცენტრალიზებული აპლიკაციები, KIX გთავაზობთ სრულიად ახალ მიდგომას ვებ ინტერფეისი შემუშავებაში, გაძლევთ საშუალებას შექმნათ სრულიდა დინამიური JSX სტრუქტურა სტატიკურად რენდერირებადი კომპონენტებით, მისი სტურქტურა სრულიად განსხვავებულია ალტერნატიული სშუალებებისგან KIX გთავაზობთ სრულიად დინამიურობას სრულიად ახალი მიდგომით ის არ საჭიროებს არანაირ სთითმენთის მენჯმენტს",
    "Text_3": "რა არის KIX?",
    "Text_4": "KIX არის javascript ის ბიბლიოთეკა რომელიც ფოკუსირებულია კოდის სიმარტივესა და სისწრაფერზე ის საშუალებას აძლევს მომხმარებელს შექმნას დინამური და მაღალი კომპლექსური პროექტი მაქსიმალურად მარტივი და სწარაფად რენდერირებადი კომპონენტებით",
    "Text_5": "აპლიკაციიის გასაშვებად აუცილებელია დაყნებული გქონდეთ Node.JS აპლიკაცია",
    "Text_6": "KIX ის დასაინსტალირებლად გახსენით ბრძანების ფანჯარა და ჩაწერეთ შემდეგი კომანდი:",
    "Text_7": "ახალი სამუშაო გარემოს შესაქმნელად გაუშვით შემდეგი ბრძანება, \"app-name\" მაგივრად მიუთითეთ აპლიკაციის დასახელება:",
    "Text_8": "აპლიკაციაში შესასველად გაუშვით შემდეგი ბრძანება:",
    "Text_9": "აპლიკაციის გასაშვებად გამოიყენეთ შემდეგი ბრძანება: ",
    "Text_10": "კომპონენტები  KIX ში",
    "Text_11": "კოპონენტები KIX ში განხსვავდება ჩვეულებრივ JSX ში მიღებული კომპონენტესბისგან, კომპონენტები ქიქსში რენდერდება სტატიკურად და არ ხდება მათი გადარენდერება რაც გვაძლევს უფრო მაღალ წარმადობას",
    "Text_12": "აპლიკაცია გთავაზობთ როგორც ფუნქციური ისე კლასობრივი კომპონენტების სრულ მსახრაჭერას",
    "Text_13": "კომპონენტის Props-ები KIX ში",
    "Text_14": "KIX ში კომპონენტის Props-ები ისეთივე დინამიურია როგორც ნებისმიერი ობიექტის property",
    "Text_15": "ფუნქციიის prop ში ჩაწოდებული ნებისმიერი ფროფერთი დინამიურად იცვლება",
    "Text_16": " კლასობრივი კომპონენტის შემთხვევაში დარენდერებისას class ში წინასწარ იქმნება props იდან შემოსული property რომელიც დინამიურად იცვლება property ის ცვლილებისას ",
    "Text_17": "ნავიგაცია  KIX ში",
    "Text_18": "ნავიგაცია KIX-ში არის ძალიან მინიმალიზირებული ის უმეტესად დაფუძნებულია Vanilla JS ის ფუნქციონალზე და არის საკმაოდ მინიმალისტური და გამოირჩევა მაღალი წარმადობით",
    "Text_19": "unique ფროფერთი განსაზღვრავს path მისამართის უნიკალურობას როუტინგის პროცესისას",
    "Text_20": "<route-block> ტეგი არენდერებს ifEmptyComponent ს თუ როუტინგისას არ იარსებებს არცერთი მასში მოთავსებული html ელემენტი",
    "Text_21": "ნავიგაციის პარამეტრეი KIX ში",
    "Text_22": "ნავიგაციიის პარამეტრები ქიქსში ინახება kix მოდულიდან დაექსპორტებულ Params ობიექტში და იცვლებიან დინამიურად როუტინგიდ მისამართის ცვლილებასთან ერთად",
    "Text_23": "ნავიგაციის ევენთები KIX ში",
    "Text_24": "KIX ი ნავიგაციის კონტროლისთვის იყენებს ჯავასკრიფტში უკვე არსებულ \"popstate\" ევენთს",
    "Text_25": "ნავიგაციის დამხმარე ფუნქციები",
    "Text_26": "ვინაიდან KIX ში არსებული ნავიგაცია მთლიანად დაფუძლებული vannila JS  ის ფუნქციონალზე KIX ში როუტინგის სამართავად გამოიყენება იგივე ფუნქციები რაც ჩვეულებრივ javascript ში უკვე არსებობს",
    "Text_27": "ფუნქციებზე მეტის გასაგებად ეწვიეთ შემდეგ ბმულს",
    "Text_28": "KIX როუტინგისას იყნრბს",
    "Text_29": "ფუნქციას.",
    "Text_30": "ხოლო როუტინგის გადასარეფრეშებლად საჭიროა popstate ევენთის გაშვება",
    "Text_31": "KIX როუტინგისას მისამართის ჩასანაცვლებლად იყენებს",
    "Text_32": "  ფუნქციას.",
    "Text_33": "ხოლო როუტინგის გადასარეფრეშებლად საჭიროა popstate ევენთის გაშვება",
    "Text_34": "KIX როუტინგისას გვერდის უკან დასაბრუნებლად იყნებს ",
    "Text_35": "  ფუნქციას.",
    "Text_36": "KIX როუტინგისას გვერდის წინ გადასასვლელად იყენებს ",
    "Text_37": " ფუნქციას.",
    "Text_38": ".useListener() ფუნქცია KIX ში",
    "Text_39": "თქვენი მხარდაჭერა პროეტს",
    "Text_40": "იმისათვის რომ პროექტი მალე განვითარდეს საჭიროებს ადამიანების მხარდაჭერას ჩვენ მადლობლები ვარ ნებისმიერი სახის მხარდაჭერისთვის",
    "Text_41": "რატომ შეიქმნა KIX და ვინ შექმნა ის?",
    "Text_42": "KIX შემქმნელი და ავტორია ",
    "Text_43": "სოსო ცერცვაძე",
    "Text_44": " ის შეიქმნა პირადი გამოყენებისთვის, მისი შექმნის იდეა წლების მანძილზე ყალიბდებოდა ავტორის პირად გამოცდილებაზე დაყრდნობით, აპლიკაციას ჰყავდა რამოდენიმე წინამორბედი სანამ ამ სასხემდე მივიდოდა ქის შემქნის პროცესისას მთავარი იდეა იყო მიგვეღო მაქსიმალურად მაღალაი წარმადობა და მაქსიმალურად დინამიური კოდი მაქსიმალურად მინიმალური რესურსებით მისი შექმნა დაიწყო 2020 წელს და დღემდე მიმდინარეობს მისი გაუმჯობესებაზე მუშაობა",
    "Text_45": "რა იქნება მომავალში?",
    "Text_46": "მომავალში ავტორი გპირდებათ მულტი პლათფორმულ მხარდაჭერას, თქვენ გექნებათ შესაძლებლობა KIX გამოიყენოთ ნებისმიერ GUI აპლიკაციის შესამქნელად (ამჟამად KIX ის გამოყენება რეკომენდირებული მხოლოდ WEB აპლიკაიების შესაქმნელად)",
    "Text_47": "რა სჭირდება KIX სწრაფი განვითარებისთვის? ",
    "Text_48": "თუ თქვენთვის საინტერესო აპლიკაციასთან გაქვთ საქმე მადლობელი ვიქნებით თუ გააცნობთ მას უფრო ფართო აუდიტორიას ეს ჩვენთვის მნიშვნელოვანია ❤️",
    "Text_49": "კონტაქტი",
    "Text_50": "ტროექტის ავტორთან დასაკავშირებლად გამოიყენეთ მეილი (",
    "Text_51": ") ან დაუკავშირდეთ მის linkedin ის ოფიციალურ ",
    "Text_52": "გვერდს",
    "Text_53": "",
    "Text_54": "",
    "Text_55": "",
    "Text_56": "",
    "Text_57": "",
    "Text_58": "",
    "Text_59": "",
    "Text_60": "",
    "Text_61": "",
    "Text_62": ""
}